app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def show
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @category = Category.create(user_params)
---
INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "wa"], ["created_at", "2016-10-31 21:35:00.525451"], ["updated_at", "2016-10-31 21:35:00.525451"]]