app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def index
    @companies = Company.all

INSERT INTO "companies" ("name", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ESPN"], ["city", "LA"], ["created_at", "2016-10-21 12:42:50.573600"], ["updated_at", "2016-10-21 12:42:50.573600"]]
---
  def create
    @company = Company.new(company_params)
    if @company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    company = Company.find(params[:id])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @company = Company.find(params[:id])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["name", "EA Sports"], ["updated_at", "2016-10-21 12:42:50.654249"], ["id", 3]]
---
  def update
    @company = Company.find(params[:id])
    @company.update(company_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 2]]
---
  def destroy
    company = Company.find(params[:id])
    company.delete