app/controllers/jobs_controller.rb

  def index
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 7]]

  def create
    @categories = Category.all
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 7]]

  def show
    @job = Job.find(params[:id])
    @comment = Comment.new
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 7]]

  def edit
    @categories = Category.all
    @job = Job.find(params[:id])
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 107]]

  def update
    @job = Job.find(params[:id])
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 140]]